wolfSSL/wolfBoot/hal/nrf54l.h
/* nrf54l.h
 *
 * Copyright (C) 2025 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#ifndef _HAL_NRF54L_H_
#define _HAL_NRF54L_H_

#include <stdint.h>

#include <string.h>

void uart_write_device(int device, const char* buf, unsigned int sz);


#if !defined(TZEN) || !defined(NONSECURE_APP)
    /* Use secure addresses */
#   define TZ_SECURE() 1
#else
    /* Use non-secure addresses */
#   define TZ_SECURE() 0
#endif

#define CPU_CLOCK 128000000UL

#define FLASH_BASE_ADDR (0x00000000UL)
#define FLASH_SIZE (1560576UL) /* 1524KB (nRF54L15) */
/* The RRAM doesn't have a page size, this is just for wolfBoot purposes */
#define FLASH_PAGE_SIZE (0x1000UL) /* 4KB granularity */
#define FLASH_END (FLASH_BASE_ADDR + FLASH_SIZE)

/* Assembly helpers */
#define DMB() __asm__ volatile ("dmb")
#define DSB() __asm__ volatile ("dsb")
#define ISB() __asm__ volatile ("isb")
#define NOP() __asm__ volatile ("nop")

/* PSEL Port (bit 5) - used across UART/SPI GPIO muxing */
#define PSEL_PORT(n)         (((n) & 0x7) << 5)


#if TZ_SECURE()
    #define CLOCK_BASE_DEFAULT              (0x5010E000UL)
    #define OSCILLATORS_BASE_DEFAULT        (0x50120000UL)
#else
    #define CLOCK_BASE_DEFAULT              (0x4010E000UL)
    #define OSCILLATORS_BASE_DEFAULT        (0x40120000UL)
#endif

#define CLOCK_BASE              CLOCK_BASE_DEFAULT
#define OSCILLATORS_BASE        OSCILLATORS_BASE_DEFAULT
#define FICR_BASE               (0x00FFC000UL)

/* Clock control registers */
#define CLOCK_TASKS_XOSTART         *((volatile uint32_t *)(CLOCK_BASE + 0x000))
#define CLOCK_TASKS_LFCLKSTART      *((volatile uint32_t *)(CLOCK_BASE + 0x010))
#define CLOCK_EVENTS_XOSTARTED      *((volatile uint32_t *)(CLOCK_BASE + 0x100))
#define CLOCK_EVENTS_LFCLKSTARTED   *((volatile uint32_t *)(CLOCK_BASE + 0x108))
#define CLOCK_XO_STAT               *((volatile uint32_t *)(CLOCK_BASE + 0x40C))
#define CLOCK_LFCLK_SRC             *((volatile uint32_t *)(CLOCK_BASE + 0x440))
#define CLOCK_LFCLK_STAT            *((volatile uint32_t *)(CLOCK_BASE + 0x44C))

#define CLOCK_TASKS_XOSTART_TASKS_XOSTART_Trigger       0x1UL
#define CLOCK_TASKS_LFCLKSTART_TASKS_LFCLKSTART_Trigger 0x1UL

#define CLOCK_XO_STAT_STATE_Pos        16UL
#define CLOCK_XO_STAT_STATE_Msk        (0x1UL << CLOCK_XO_STAT_STATE_Pos)
#define CLOCK_XO_STAT_STATE_NotRunning 0x0UL
#define CLOCK_XO_STAT_STATE_Running    0x1UL

#define CLOCK_LFCLK_SRC_SRC_Pos        0UL
#define CLOCK_LFCLK_SRC_SRC_Msk        (0x3UL << CLOCK_LFCLK_SRC_SRC_Pos)
#define CLOCK_LFCLK_SRC_SRC_LFRC       0x0UL
#define CLOCK_LFCLK_SRC_SRC_LFXO       0x1UL
#define CLOCK_LFCLK_SRC_SRC_LFSYNT     0x2UL

#define CLOCK_LFCLK_STAT_SRC_Pos       0UL
#define CLOCK_LFCLK_STAT_SRC_Msk       (0x3UL << CLOCK_LFCLK_STAT_SRC_Pos)
#define CLOCK_LFCLK_STAT_SRC_LFRC      0x0UL
#define CLOCK_LFCLK_STAT_SRC_LFXO      0x1UL
#define CLOCK_LFCLK_STAT_SRC_LFSYNT    0x2UL

#define CLOCK_LFCLK_STAT_STATE_Pos     16UL
#define CLOCK_LFCLK_STAT_STATE_Msk     (0x1UL << CLOCK_LFCLK_STAT_STATE_Pos)
#define CLOCK_LFCLK_STAT_STATE_NotRunning 0x0UL
#define CLOCK_LFCLK_STAT_STATE_Running 0x1UL

/* LFCLK source and oscillator trims */
#define OSCILLATORS_XOSC32KI_INTCAP *((volatile uint32_t *)(OSCILLATORS_BASE + 0x904))
#define OSCILLATORS_XOSC32KI_INTCAP_ResetValue   0x00000017UL
#define OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos      0UL
#define OSCILLATORS_XOSC32KI_INTCAP_VAL_Msk      (0x1FUL << OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos)

#define FICR_XOSC32KTRIM             *((volatile uint32_t *)(FICR_BASE + 0x624))
#define FICR_XOSC32KTRIM_ResetValue  0xFFFFFFFFUL
#define FICR_XOSC32KTRIM_OFFSET_Pos  16UL
#define FICR_XOSC32KTRIM_OFFSET_Msk  (0x3FFUL << FICR_XOSC32KTRIM_OFFSET_Pos)

/* RRAM controller */
#define RRAMC_BASE_DEFAULT            (0x5004B000UL)
#define RRAMC_BASE                    RRAMC_BASE_DEFAULT

#define RRAMC_TASKS_COMMITWRITEBUF    *((volatile uint32_t *)(RRAMC_BASE + 0x008))
#define RRAMC_READY                   *((volatile uint32_t *)(RRAMC_BASE + 0x400))
#define RRAMC_READYNEXT               *((volatile uint32_t *)(RRAMC_BASE + 0x404))
#define RRAMC_BUFSTATUS_WRITEBUFEMPTY *((volatile uint32_t *)(RRAMC_BASE + 0x418))
#define RRAMC_CONFIG                  *((volatile uint32_t *)(RRAMC_BASE + 0x500))

#define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Trigger 0x1UL

#define RRAMC_READY_READY_Pos         0UL
#define RRAMC_READY_READY_Msk         (0x1UL << RRAMC_READY_READY_Pos)

#define RRAMC_READYNEXT_READYNEXT_Pos 0UL
#define RRAMC_READYNEXT_READYNEXT_Msk (0x1UL << RRAMC_READYNEXT_READYNEXT_Pos)

#define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos 0UL
#define RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Msk \
    (0x1UL << RRAMC_BUFSTATUS_WRITEBUFEMPTY_EMPTY_Pos)

#define RRAMC_CONFIG_WEN_Pos          0UL
#define RRAMC_CONFIG_WEN_Msk          (0x1UL << RRAMC_CONFIG_WEN_Pos)

/* TWIM */
#if TZ_SECURE()
    #define TWIM20_BASE_DEFAULT       (0x500C6000UL)
#else
    #define TWIM20_BASE_DEFAULT       (0x400C6000UL)
#endif

#define PMIC_TWIM_BASE                TWIM20_BASE_DEFAULT

#define TWIM_TASKS_STOP(base)         (*((volatile uint32_t *)((base) + 0x004)))
#define TWIM_TASKS_DMA_RX_START(base) (*((volatile uint32_t *)((base) + 0x028)))
#define TWIM_TASKS_DMA_TX_START(base) (*((volatile uint32_t *)((base) + 0x050)))
#define TWIM_EVENTS_STOPPED(base)     (*((volatile uint32_t *)((base) + 0x104)))
#define TWIM_EVENTS_ERROR(base)       (*((volatile uint32_t *)((base) + 0x114)))
#define TWIM_EVENTS_LASTRX(base)      (*((volatile uint32_t *)((base) + 0x134)))
#define TWIM_EVENTS_LASTTX(base)      (*((volatile uint32_t *)((base) + 0x138)))
#define TWIM_EVENTS_DMA_RX_END(base)  (*((volatile uint32_t *)((base) + 0x14C)))
#define TWIM_EVENTS_DMA_TX_END(base)  (*((volatile uint32_t *)((base) + 0x168)))
#define TWIM_SHORTS_REG(base)         (*((volatile uint32_t *)((base) + 0x200)))
#define TWIM_ERRORSRC_REG(base)       (*((volatile uint32_t *)((base) + 0x4C4)))
#define TWIM_ENABLE_REG(base)         (*((volatile uint32_t *)((base) + 0x500)))
#define TWIM_FREQUENCY_REG(base)      (*((volatile uint32_t *)((base) + 0x524)))
#define TWIM_ADDRESS_REG(base)        (*((volatile uint32_t *)((base) + 0x588)))
#define TWIM_PSEL_SCL_REG(base)       (*((volatile uint32_t *)((base) + 0x600)))
#define TWIM_PSEL_SDA_REG(base)       (*((volatile uint32_t *)((base) + 0x604)))
#define TWIM_DMA_RX_PTR(base)         (*((volatile uint32_t *)((base) + 0x704)))
#define TWIM_DMA_RX_MAXCNT(base)      (*((volatile uint32_t *)((base) + 0x708)))
#define TWIM_DMA_RX_TERMINATE(base)   (*((volatile uint32_t *)((base) + 0x71C)))
#define TWIM_DMA_TX_PTR(base)         (*((volatile uint32_t *)((base) + 0x73C)))
#define TWIM_DMA_TX_MAXCNT(base)      (*((volatile uint32_t *)((base) + 0x740)))
#define TWIM_DMA_TX_TERMINATE(base)   (*((volatile uint32_t *)((base) + 0x754)))

