wolfSSL/wolfBoot/hal/nrf54l.h
#define UART_DMA_TX_PTR(n)             *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x038 + 0x004))
#define UART_DMA_TX_MAXCNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x038 + 0x008))

#define UART_DMA_RX_PTR(n)             *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x004))
#define UART_DMA_RX_MAXCNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x008))
#define UART_DMA_RX_AMOUNT(n)          *((volatile uint32_t *)(UART_BASE(n) + 0x700 + 0x000 + 0x00C))

#define UART_EVENTS_DMA_TX_END(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x01C + 0x000))
#define UART_EVENTS_DMA_TX_BUSERROR(n) *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x01C + 0x008))
#define UART_EVENTS_DMA_RX_END(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x000 + 0x000))
#define UART_EVENTS_DMA_RX_BUSERROR(n) *((volatile uint32_t *)(UART_BASE(n) + 0x14C + 0x000 + 0x008))

#define UART_TASKS_DMA_TX_START(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x028 + 0x000))
#define UART_TASKS_DMA_TX_STOP(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x028 + 0x004))

#define UART_TASKS_DMA_RX_START(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x000 + 0x000))
#define UART_TASKS_DMA_RX_STOP(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x028 + 0x000 + 0x004))

/* UART Settings */
#define UART_ENABLE_ENABLE_Enabled             0x8UL
#define UART_ENABLE_ENABLE_Disabled            0x0UL

#define UART_PSEL_TXD_PIN_Pos                  0UL
#define UART_PSEL_TXD_PIN_Msk                  (0x1FUL << UART_PSEL_TXD_PIN_Pos)
#define UART_PSEL_TXD_PORT_Pos                 5UL
#define UART_PSEL_TXD_PORT_Msk                 (0x7UL << UART_PSEL_TXD_PORT_Pos)

#define UART_PSEL_RXD_PIN_Pos                  0UL
#define UART_PSEL_RXD_PIN_Msk                  (0x1FUL << UART_PSEL_RXD_PIN_Pos)
#define UART_PSEL_RXD_PORT_Pos                 0x5UL
#define UART_PSEL_RXD_PORT_Msk                 (0x7UL << UART_PSEL_RXD_PORT_Pos)

#define UART_PSEL_CTS_CONNECT_Disconnected     (0x1UL << 31)
#define UART_PSEL_RTS_CONNECT_Disconnected     (0x1UL << 31)

#define UART_CONFIG_FRAMESIZE_Pos              9UL
#define UART_CONFIG_FRAMESIZE_8bit             0x8UL
#define UART_CONFIG_8N1                        (UART_CONFIG_FRAMESIZE_8bit << UART_CONFIG_FRAMESIZE_Pos)

#define UART_TASKS_DMA_TX_START_START_Trigger  0x1UL
#define UART_TASKS_DMA_TX_STOP_STOP_Trigger    0x1UL

#define UART_TASKS_DMA_RX_START_START_Trigger  0x1UL
#define UART_TASKS_DMA_RX_STOP_STOP_Trigger    0x1UL

#define UART_BAUDRATE_BAUDRATE_Baud115200      0x01D60000UL

#define BAUD_115200  UART_BAUDRATE_BAUDRATE_Baud115200

/* Nordic PMIC */
#define PMIC_TWIM_PORT                1
#define PMIC_TWIM_SDA_PIN             2
#define PMIC_TWIM_SCL_PIN             3
#define PMIC_TWIM_TIMEOUT             1000000UL
#define PMIC_REG_PAYLOAD_MAX          8U
#define PMIC_I2C_ADDRESS              0x6BU      // from pdf p122 (110 1011)

#define LED_PWR_CTRL_PORT             1
#define LED_PWR_CTRL_PIN              13

#define NPM1300_REG_TASK_LDSW2_SET    0x0802U
#define NPM1300_REG_TASK_LDSW2_CLR    0x0803U
#define NPM1300_REG_LDSW2_GPISEL      0x0806U
#define NPM1300_REG_LDSWCONFIG        0x0807U
#define NPM1300_REG_LDSW2LDOSEL       0x0809U
#define NPM1300_REG_GPIOMODE(n)       (0x0600U + (uint16_t)(n))
#define NPM1300_REG_GPIOPUEN(n)       (0x060AU + (uint16_t)(n))
#define NPM1300_REG_GPIOPDEN(n)       (0x060FU + (uint16_t)(n))

/* SPIM */
#if TZ_SECURE()
    #define SPIM00_BASE_DEFAULT       (0x5004A000UL)
#else
    #define SPIM00_BASE_DEFAULT       (0x4004A000UL)
#endif

#define SPI_BASE                    SPIM00_BASE_DEFAULT

#define SPI_TASKS_START             (*((volatile uint32_t *)(SPI_BASE + 0x000)))
#define SPI_TASKS_STOP              (*((volatile uint32_t *)(SPI_BASE + 0x004)))

#define SPI_EVENTS_STARTED          (*((volatile uint32_t *)(SPI_BASE + 0x100)))
#define SPI_EVENTS_STOPPED          (*((volatile uint32_t *)(SPI_BASE + 0x104)))
#define SPI_EVENTS_END              (*((volatile uint32_t *)(SPI_BASE + 0x108)))

#define SPI_EVENTS_DMA_RX_END       (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x000)))
#define SPI_EVENTS_DMA_RX_READY     (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x004)))
#define SPI_EVENTS_DMA_RX_BUSERROR  (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x008)))
#define SPI_EVENTS_DMA_TX_END       (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x01C)))
#define SPI_EVENTS_DMA_TX_READY     (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x020)))
#define SPI_EVENTS_DMA_TX_BUSERROR  (*((volatile uint32_t *)(SPI_BASE + 0x14C + 0x024)))

#define SPI_ENABLE_REG              (*((volatile uint32_t *)(SPI_BASE + 0x500)))
#define SPI_PRESCALER_REG           (*((volatile uint32_t *)(SPI_BASE + 0x52C)))
#define SPI_CONFIG_REG              (*((volatile uint32_t *)(SPI_BASE + 0x554)))
#define SPI_IFTIMING_RXDELAY        (*((volatile uint32_t *)(SPI_BASE + 0x5AC)))
#define SPI_IFTIMING_CSNDUR         (*((volatile uint32_t *)(SPI_BASE + 0x5B0)))

#define SPI_PSEL_SCK                (*((volatile uint32_t *)(SPI_BASE + 0x600)))
#define SPI_PSEL_MOSI               (*((volatile uint32_t *)(SPI_BASE + 0x604)))
#define SPI_PSEL_MISO               (*((volatile uint32_t *)(SPI_BASE + 0x608)))
#define SPI_PSEL_CSN                (*((volatile uint32_t *)(SPI_BASE + 0x610)))

#define SPI_DMA_RX_PTR              (*((volatile uint32_t *)(SPI_BASE + 0x704)))
#define SPI_DMA_RX_MAXCNT           (*((volatile uint32_t *)(SPI_BASE + 0x708)))
#define SPI_DMA_RX_LIST             (*((volatile uint32_t *)(SPI_BASE + 0x714)))

#define SPI_DMA_TX_PTR              (*((volatile uint32_t *)(SPI_BASE + 0x73C)))
#define SPI_DMA_TX_MAXCNT           (*((volatile uint32_t *)(SPI_BASE + 0x740)))
#define SPI_DMA_TX_LIST             (*((volatile uint32_t *)(SPI_BASE + 0x74C)))

#define SPIM_TASKS_START_TASKS_START_Pos     0UL
#define SPIM_TASKS_START_TASKS_START_Msk \
    (0x1UL << SPIM_TASKS_START_TASKS_START_Pos)
#define SPIM_TASKS_START_TASKS_START_Trigger 0x1UL

#define SPIM_TASKS_STOP_TASKS_STOP_Pos       0UL
#define SPIM_TASKS_STOP_TASKS_STOP_Msk \
    (0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos)
#define SPIM_TASKS_STOP_TASKS_STOP_Trigger   0x1UL

