wolfSSL/wolfBoot/hal/nrf54l.h
#define SPIM_ENABLE_ENABLE_Pos               0UL
#define SPIM_ENABLE_ENABLE_Msk               (0xFUL << SPIM_ENABLE_ENABLE_Pos)
#define SPIM_ENABLE_ENABLE_Disabled          0x0UL
#define SPIM_ENABLE_ENABLE_Enabled           0x7UL

#define SPIM_CONFIG_ORDER_Pos                0UL
#define SPIM_CONFIG_ORDER_Msk                (0x1UL << SPIM_CONFIG_ORDER_Pos)
#define SPIM_CONFIG_ORDER_MsbFirst           0x0UL
#define SPIM_CONFIG_ORDER_LsbFirst           0x1UL

#define SPIM_CONFIG_CPHA_Pos                 1UL
#define SPIM_CONFIG_CPHA_Msk                 (0x1UL << SPIM_CONFIG_CPHA_Pos)
#define SPIM_CONFIG_CPHA_Leading             0x0UL
#define SPIM_CONFIG_CPHA_Trailing            0x1UL

#define SPIM_CONFIG_CPOL_Pos                 2UL
#define SPIM_CONFIG_CPOL_Msk                 (0x1UL << SPIM_CONFIG_CPOL_Pos)
#define SPIM_CONFIG_CPOL_ActiveHigh          0x0UL
#define SPIM_CONFIG_CPOL_ActiveLow           0x1UL

#define SPI_PRESCALER_DIV                    0x08UL

/* SPU - Security Processing Unit
 *
 * nRF54L has four SPU instances, one per power domain:
 *   SPU00 (MCU domain)   0x50040000  covers peripherals at 0x5004xxxx-0x5007xxxx
 *   SPU10 (RADIO domain) 0x50080000  covers peripherals at 0x5008xxxx-0x500Bxxxx
 *   SPU20 (PERI domain)  0x500C0000  covers peripherals at 0x500Cxxxx-0x500Fxxxx
 *   SPU30 (LP domain)    0x50100000  covers peripherals at 0x5010xxxx-0x5013xxxx
 */
#define SPU00_BASE  (0x50040000UL)  /* MCU domain   */
#define SPU10_BASE  (0x50080000UL)  /* RADIO domain */
#define SPU20_BASE  (0x500C0000UL)  /* PERI domain  */
#define SPU30_BASE  (0x50100000UL)  /* LP domain    */

/* Derive which SPU instance governs a peripheral */
#define SPU_BASE_FOR(paddr)     (0x50000000UL | ((paddr) & 0x00FC0000UL))
/* Derive the slave index within that SPU */
#define SPU_SLAVE_IDX(paddr)    (((paddr) & 0x0003F000UL) >> 12)

#define SPU_PERIPH_PERM(spu, n) \
    (*((volatile uint32_t *)((spu) + 0x500UL + (uint32_t)(n) * 4UL)))

#define SPU_FEATURE_GPIO_PIN(spu, g, p) \
    (*((volatile uint32_t *)((spu) + 0x800UL + (uint32_t)(g) * 0x80UL + \
                              (uint32_t)(p) * 4UL)))

#define SPU_PERIPH_PERM_SECATTR (1UL << 4)
#define SPU_FEATURE_SECATTR     (1UL << 4)

/* Non-secure RAM layout */
#define NS_RAM_BASE  (0x20010000UL)
#define NS_RAM_SIZE  (0x00030000UL)

/* MPC00 - Memory Privilege Controller */
#define MPC00_BASE  (0x50041000UL)

#define MPC_OVERRIDE_CONFIG(n) \
    (*((volatile uint32_t *)(MPC00_BASE + 0x800UL + (uint32_t)(n) * 0x20UL)))
#define MPC_OVERRIDE_STARTADDR(n) \
    (*((volatile uint32_t *)(MPC00_BASE + 0x804UL + (uint32_t)(n) * 0x20UL)))
#define MPC_OVERRIDE_ENDADDR(n) \
    (*((volatile uint32_t *)(MPC00_BASE + 0x808UL + (uint32_t)(n) * 0x20UL)))
#define MPC_OVERRIDE_PERM(n) \
    (*((volatile uint32_t *)(MPC00_BASE + 0x810UL + (uint32_t)(n) * 0x20UL)))
#define MPC_OVERRIDE_PERMMASK(n) \
    (*((volatile uint32_t *)(MPC00_BASE + 0x814UL + (uint32_t)(n) * 0x20UL)))

#define MPC_CONFIG_ENABLE   (1UL << 9)
#define MPC_PERM_READ       (1UL << 0)
#define MPC_PERM_WRITE      (1UL << 1)
#define MPC_PERM_EXECUTE    (1UL << 2)
#define MPC_PERM_SECURE     (1UL << 3)  /* 0 = NonSecure, 1 = Secure */

/* TAMPC - Tamper controller (access port protection) */
#define TAMPC_BASE                              (0x500DC000UL)
#define TAMPC_PROTECT_DOMAIN0_DBGEN_CTRL   (*(volatile uint32_t *)(TAMPC_BASE + 0x500))
#define TAMPC_PROTECT_DOMAIN0_NIDEN_CTRL   (*(volatile uint32_t *)(TAMPC_BASE + 0x508))
#define TAMPC_PROTECT_DOMAIN0_SPIDEN_CTRL  (*(volatile uint32_t *)(TAMPC_BASE + 0x510))
#define TAMPC_PROTECT_DOMAIN0_SPNIDEN_CTRL (*(volatile uint32_t *)(TAMPC_BASE + 0x518))
#define TAMPC_PROTECT_AP0_DBGEN_CTRL       (*(volatile uint32_t *)(TAMPC_BASE + 0x700))

/* KEY=0x50FA at bits[31:16], WRITEPROTECTION_Clear=0xF at bits[7:4] */
#define TAMPC_SIGNAL_CLEAR_WRITEPROTECTION  (0x50FA00F0UL)
/* KEY=0x50FA at bits[31:16], VALUE=High at bit[0], LOCK=Disabled at bit[1] */
#define TAMPC_SIGNAL_OPEN                   (0x50FA0001UL)
#define TAMPC_SIGNAL_LOCK_Msk               (1UL << 1)

/* CRACEN (Crypto Accelerator) */
#define CRACEN_BASE                  (0x50048000UL)
#define CRACENCORE_BASE              (0x51800000UL)

/* CRACEN.ENABLE register (offset 0x400) */
#define CRACEN_ENABLE                (*((volatile uint32_t *)(CRACEN_BASE + 0x400)))
#define CRACEN_ENABLE_RNG_Msk        (0x1UL << 1)

#define CRACENCORE_RNGCTRL_BASE      (CRACENCORE_BASE + 0x1000UL)

#define CRACENCORE_RNG_CONTROL       (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x000)))
#define CRACENCORE_RNG_FIFOLEVEL     (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x004)))
#define CRACENCORE_RNG_KEY(n)        (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x010 + (n)*4)))
#define CRACENCORE_RNG_STATUS        (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x030)))
#define CRACENCORE_RNG_INITWAITVAL   (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x034)))
#define CRACENCORE_RNG_SWOFFTMRVAL   (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x040)))
#define CRACENCORE_RNG_CLKDIV        (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x044)))
#define CRACENCORE_RNG_FIFO          (*((volatile uint32_t *)(CRACENCORE_RNGCTRL_BASE + 0x080)))

#define CRACENCORE_RNG_CONTROL_ENABLE_Msk         (0x1UL << 0)
#define CRACENCORE_RNG_CONTROL_SOFTRST_Msk        (0x1UL << 8)
#define CRACENCORE_RNG_CONTROL_NB128BITBLOCKS_Pos 16
#define CRACENCORE_RNG_CONTROL_NB128BITBLOCKS_Msk (0xFUL << CRACENCORE_RNG_CONTROL_NB128BITBLOCKS_Pos)

#define CRACENCORE_RNG_STATUS_STATE_Pos     1
#define CRACENCORE_RNG_STATUS_STATE_Msk     (0x7UL << CRACENCORE_RNG_STATUS_STATE_Pos)
#define CRACENCORE_RNG_STATUS_STATE_RESET   0x0UL
#define CRACENCORE_RNG_STATUS_STATE_STARTUP 0x1UL

/* TRNG configuration values recommended by Nordic */
#define CRACENCORE_RNG_INITWAITVAL_DEFAULT  512UL
#define CRACENCORE_RNG_NB128BITBLOCKS_DEFAULT 4UL

#endif /* _HAL_NRF54L_H_ */
